tests/results/bf16-dflash-ab-capacity48-20260712/target_only/throughput/concurrency-24-prompts-48.log
benchmark_args=Namespace(backend='sglang', base_url='http://127.0.0.1:33000', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='/workspace/models/opd-32b-deploy', served_model_name=None, tokenizer='/workspace/models/opd-32b-deploy', num_prompts=48, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=512, random_output_len=512, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=24, output_file='/workspace/aimo-proof-pilot-eval/tests/results/bf16-dflash-ab-capacity48-20260712/target_only/throughput/concurrency-24-prompts-48.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=20260711, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:33000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url='http://127.0.0.1:33000', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='/workspace/models/opd-32b-deploy', served_model_name=None, tokenizer='/workspace/models/opd-32b-deploy', num_prompts=48, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=512, random_output_len=512, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=24, output_file='/workspace/aimo-proof-pilot-eval/tests/results/bf16-dflash-ab-capacity48-20260712/target_only/throughput/concurrency-24-prompts-48.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=20260711, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 24576
#Output tokens: 24576
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 24        
Successful requests:                     48        
Benchmark duration (s):                  38.30     
Total input tokens:                      24576     
Total input text tokens:                 24576     
Total generated tokens:                  24576     
Total generated tokens (retokenized):    24568     
Request throughput (req/s):              1.25      
Input token throughput (tok/s):          641.67    
Output token throughput (tok/s):         641.67    
Peak output token throughput (tok/s):    720.00    
Peak concurrent requests:                48        
Total token throughput (tok/s):          1283.33   
Concurrency:                             23.98     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   19131.33  
Median E2E Latency (ms):                 19131.17  
P90 E2E Latency (ms):                    19148.20  
P95 E2E Latency (ms):                    19148.40  
P99 E2E Latency (ms):                    19149.16  
---------------Time to First Token----------------
Mean TTFT (ms):                          880.80    
Median TTFT (ms):                        881.75    
P90 TTFT (ms):                           1405.23   
P95 TTFT (ms):                           1484.46   
P99 TTFT (ms):                           1490.33   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          35.72     
Median TPOT (ms):                        35.71     
P90 TPOT (ms):                           36.68     
P95 TPOT (ms):                           36.95     
P99 TPOT (ms):                           37.15     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           35.72     
Median ITL (ms):                         34.62     
P90 ITL (ms):                            34.85     
P95 ITL (ms):                            35.59     
P99 ITL (ms):                            90.24     
Max ITL (ms):                            118.78    
==================================================